/**
* @file
* @date 2019/1/29
*/

<template>
  <div class="protocol">
    <div class="header">
      <div class="back" @click.stop.prevent="back">
        <img src="../assets/img/return_back.png" width="10" height="18">
      </div>
      币币贷借贷服务协议
    </div>
    <scroll :probeType="probeType" :listenScroll="listenScroll" class="common-page">
      <div class="content">
        <p class="mb">请仔细阅读以下借贷服务协议（以下或称为“本协议”）。由于此协议具有法律约束力，请在发布借款或者进行出借前仔细阅读。</p>
        <p class="mb">借款人具有完全民事权利能力和民事行为能力的自然人/法人/其他组织。<br>
          出借人具有完全民事权利能力和民事行为能力的自然人/法人/其他组织。<br>
          币币贷是依法成立且有效存续的公司，运营管理币币贷平台，为借款人和出借人的交易提供居间信息服务。</p>
        <p>第一条 关于本协议的确认与接纳</p>
        <p>1、您理解本协议适用于币币贷平台。</p>
        <p>2、本协议可由币币贷随时更新，经修改的协议一经在币币贷上公布，立即自动生效，恕不再另行通知。</p>
        <p class="mb">3、如果您未满18周岁，或者是无民事行为能力或限制民事行为能力，请在父母或监护人指导下使用币币贷。</p>
        <p>第二条 各方的权利和义务</p>
        <p>一、出借人的权利义务</p>
        <p>（一）出借人权利</p>
        <p>1、有权委托币币贷对借款人的身份信息及质押资产进行审查；</p>
        <p>2、按照本协议的约定回收借款本息；</p>
        <p>3、当发现借款人存在提供虚假身份信息、融资借款信息等违约情形时，有权要求提前收回借款本息。</p>
        <p>（二）出借人义务</p>
        <p>1、妥善保管好其平台账号密码，不得将其平台用户名、账号、密码等转让、出租、出借给任何第三方使用； </p>
        <p>2、提供真实、准确、完整的身份信息，当提供的信息有变更时，3日内在币币贷平台进行更新；</p>
        <p>3、确保出借资金为来源合法的自有资金；</p>
        <p>4、按照约定，及时向币币贷及有关方支付相关税、费。</p>
        <p>二、借款人权利义务</p>
        <p>（一）借款人权利</p>
        <p>1、有权按照协议的约定收取所借款项，并按本协议约定用途使用所借资金；</p>
        <p>2、有权要求出借人提供真实、准确、完整的身份信息及接收还款款项的有效账户信息；</p>
        <p>3、有权委托币币贷平台对存放在平台内的数字资产安全性进行保证；</p>
        <p>4、有权委托币币贷平台对借款申请订单匹配合适的出借订单。</p>
        <p>（二）借款人义务</p>
        <p>1、妥善保管好其平台账号密码，不得将其平台用户名、账号、密码等转让、出租、出借给任何第三方使用； </p>
        <p>2、向协议各方提供真实、准确、完整的身份信息，当提供的信息有变更时，3日内在币币贷平台进行更新； </p>
        <p>3、按照本协议的约定按时偿还借款本息； </p>
        <p>4、按照本协议的约定按时向币币贷或有关方支付相关税、费。</p>
        <p>三、币币贷平台权利义务 </p>
        <p>（一）币币贷平台权利</p>
        <p>1、要求借款人和出借人（以下简称为双方）提供真实、准确、完整的身份信息，并在币币贷平台进行实名注册；登记信息发生变更的，有权要求双方在3日内通知到币币贷；</p>
        <p>2、有权按照法律法规和网络借贷有关监管规定要求报送本协议有关债权债务信息，并根据规定向有关数据统计部门报送并登记；</p>
        <p>3、发现本协议借贷各方存在提供虚假资料、虚假陈述等欺诈情形的，有权根据本协议约定提前终止本借贷协议，并要求各方根据本协议约定提前清算债权债务；</p>
        <p>4、发现本协议借贷有可能属于监管部门认定的可疑借贷的，有权及时向监管部门就本协议借贷发送相应报告或信息；</p>
        <p>5、有权根据双方的委托或授权，为本协议的履行提供协助服务；</p>
        <p>6、有权根据本协议的约定向双方收取居间服务费用。</p>
        <p>（二）币币贷平台义务</p>
        <p>1、对双方提供的信息的真实性、合法性进行必要的审核； </p>
        <p>2、依据双方提供的信息，准确、完整地向本协议有关方进行披露； </p>
        <p class="mb">3、妥善保管双方的资料和交易信息，不得私自删除、篡改，不得非法买卖、泄露双方的基本信息和交易信息。</p>
        <p>第三条 居间费用</p>
        <p class="b mb">因币币贷为本协议的订立提供了居间服务，故币币贷有权向双方收取一定的居间服务费，收费标准为：借款金额*0.5%，于借款达成时收取。币币贷有权对居间服务费标准进行变更，变更后的收费标准会在币币贷平台进行说明。</p>
        <p>第四条 特别约定</p>
        <p>1、在借款人发生逾期还款情形时，出借人授权币币贷平台对借款人质押资产进行交易，并将交易所得部分首先偿还出借人的应收本息。</p>
        <p class="b">2、借款人在平台的质押资产价格发生变动时，按如下规则处理。初始质押率为50%，当质押率为66%时，币币贷平台将提醒借款人进行补质押资产，请注意币币贷平台没有责任和义务提醒借款人，借款人应主动关注质押资产价格变动，如由于未及时补充质押资产导致被平仓，则借款人承担相关责任。当质押率变为80%时，币币贷有权对质押资产进行交易，用以偿还出借人本息和平台损失。借款人不再拥有对质押资产的所有权。其中，质押率=（借出代币价值+服务费+利息）/质押代币价值。</p>
        <p>3、借款人和出借人双方应保管好其平台账号密码，不得将其平台用户名、账号、密码等转让、出租、出借给任何第三人使用，并注意查收任何其账户的站内信息、通知、邮件。双方明确知悉并确认，通过其用户名、账号和密码登陆后的任何账户操作均视为是其本人的操作及真实意思表示，该类操作下的一切法律后果由其自行承担。 </p>
        <p class="b">4、借款人应按照本协议约定，在还款日（不得迟于系统提示的最终还款时间）或之前在币币贷平台进行还款操作，该相应款项应包括但不限于偿还本息、罚息（若有）、违约金（若有）等其他相关费用。 </p>
        <p class="b mb">5、由于质押资产价格可能在较短时间内发生剧烈波动，由此可能导致的借款人来不及补仓而被强制平仓所带来的损失由借款人承担，由此可能导致的平台来不及执行强制平仓所带来的出借人的损失由出借人承担。</p>
        <p>第五条 提前还款</p>
        <p>（一）各方确认，借款人有权按照币币贷运营管理的币币贷平台规则提前偿还剩余借款，借款人提前还款的，应按照如下顺序清偿：</p>
        <p>1、拖欠币币贷及为借款人提供借款相关服务的币币贷合作方的费用；</p>
        <p>2、拖欠的平台相关费用；</p>
        <p>3、违约金； </p>
        <p>4、已逾期的利息；</p>
        <p>5、已逾期的本金；  </p>
        <p>6、新到期利息； </p>
        <p>7、新到期本金；</p>
        <p>8、未到期的本金。 </p>
        <p class="mb">（二）借款人为币币贷合作方推介的借款人的，借款人提前还款还须遵守其与币币贷合作方之间的协议约定。</p>
        <p class="b">第六条 逾期还款</p>
        <p class="b">当借款人未能按照本协议约定按时足额还款（包括但不限于到期的本金及利息、拖欠的本金及利息、违约金、平台服务费等）发生还款逾期时，借款人须按照如下还款顺序进行还款：</p>
        <p class="b">1、发生多笔还款逾期时，按借款到期的先后顺序进行还款； </p>
        <p class="b">2、就每一笔到期款项而言，偿还的先后顺序为：拖欠币币贷及为借款人提供借款相关服务的币币贷合作方的费用；逾期违约金；拖欠的利息；拖欠的本金；新到期利息；新到期本金；</p>
        <p class="b mb">3、逾期违约金为：（本金+利息）*25%.</p>
        <p >第七条 违约责任</p>
        <p>1、若因出借人违反本协议的约定提供虚假资料、隐瞒事实、进行违规出借，导致本协议被解除或被认定无效的，由出借人按本协议约定借款金额的5%分别向其借款人及币币贷支付违约金；若因借款人违反本协议的约定提供虚假资料、隐瞒事实、进行违规骗贷，导致本协议被解除或被认定无效的，由借款人按本协议约定借款金额的5%向出借人支付违约金，同时按其预留至币币贷处的质押资产的5%向币币贷支付违约金。</p>
        <p class="mb">2、任何一方违约，违约方除应向各方支付违约金外，还应承担因违约导致其他各方产生的一切相关费用和其它损失，包括但不限于调查、诉讼费、律师费等一切合理费用。</p>
        <p>第八条 法律及争议解决</p>
        <p class="mb">本协议的签订、履行、终止、解释均适用新加坡共和国法律，因本协议引起的或与本协议有关的任何争议，应当通过友好协商解决，协商不成的，任何一方有权向新加坡国际仲裁中心依申请仲裁时该委员会现行有效的仲裁规则申请仲裁，诉讼费用、律师费以及其他相关费用，由败诉方承担。</p>
        <p>第九条 协议的效力</p>
        <p>1、本协议采用电子文本签约形式，先由借款人在平台上单方点击“确认”本协议条款，币币贷将借款信息（包括本协议及其附件）发布在币币贷平台，出借人在币币贷平台点击“确认”本协议条款，视为出借人认可本电子借款协议以及本协议及其附件内容，本协议生效。</p>
        <p>2、出借人、借款人均同意并确认，双方借款和还款的资金划付均通过双方私下协商的方式一对一进行，所产生的法律效果及法律责任归属于出借人、借款人。同时，出借人、借款人委托币币贷根据本协议采取的全部行动和措施的法律后果均归属于出借人、借款人，币币贷不因此承担责任。</p>
        <p>3、本协议的任何条款的无效不影响本协议其他条款的效力。</p>

      </div>
    </scroll>
  </div>


</template>

<script>
  import Scroll from './children/scroll_init.vue';

  export default {
    name: "protocol",
    components: {Scroll},
    data() {
      return {
        probeType: 3,
        listenScroll: true
      }
    },
    methods: {
      back() {
        this.$router.back();
      }
    }
  }
</script>

<style scoped lang="scss">
  .protocol {
    position: relative;
    .header {
      height: 88px;
      width: 100%;
      border-bottom: 1px solid #e2e2e2;
      position: fixed;
      top:0;
      left:0;
      right:0;
      display: flex;
      justify-content: center;
      align-items: center;
      color: #111e4b;
      font-size: 36px;
      z-index: 99;
      background: #fff;
      .back {
        position: absolute;
        left: 30px;
        top: 20px;
      }
    }
    .common-page {
      position: fixed;
      top: 89px;
      bottom: 0;
      left:0;
      right: 0;
      .content {
        padding: 20px 30px 0 30px;
        p {
          color: #485063;
          font-size: 28px;
          line-height: 1.2;
          &.mb {
            margin-bottom: 30px;
          }
          &.b {
            font-weiht: 600;
          }
        }
      }
    }

  }

</style>
